---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.UndefinedFluidUnit
source: html/7e087ab8-7e75-68f6-725e-62a76a3c5d06.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.UndefinedFluidUnit Property

Undefined fluid unit: '[Fluid Unit Type Name]'

## Syntax (C#)
```csharp
public static FailureDefinitionId UndefinedFluidUnit { get; }
```